In [48]:
import pandas as pd
import numpy as np

# Reshaping and Pivoting


Another data combination situation canâ€™t be expressed as either a merge or concatenation operation. You may have two datasets whose indexes overlap in full or part

In [3]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),index=pd.Index(['Ohio', 'Colorado'], name='state'),columns=pd.Index(['one', 'two', 'three'], name='number'))

In [4]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [5]:
result = data.stack()

In [6]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [9]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [34]:
result.unstack(0) #or 1

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [36]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [12]:
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])

In [13]:
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])

In [14]:
data2 = pd.concat([s1, s2], keys=['one', 'two'])

In [15]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [18]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [19]:
 data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [31]:
df = pd.DataFrame({'left': result, 'right': result + 5},columns=pd.Index(['left', 'right'], name='side'))

In [32]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

# Discretization and Binning

In [35]:
 data = np.random.randn(1000)

In [36]:
cats = pd.qcut(data, 4)

In [37]:
cats

[(0.0167, 0.661], (-0.625, 0.0167], (-2.88, -0.625], (-2.88, -0.625], (-2.88, -0.625], ..., (0.661, 3.324], (0.0167, 0.661], (-2.88, -0.625], (0.661, 3.324], (-0.625, 0.0167]]
Length: 1000
Categories (4, interval[float64]): [(-2.88, -0.625] < (-0.625, 0.0167] < (0.0167, 0.661] < (0.661, 3.324]]

In [38]:
 pd.value_counts(cats)

(0.661, 3.324]      250
(0.0167, 0.661]     250
(-0.625, 0.0167]    250
(-2.88, -0.625]     250
dtype: int64

In [39]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.0167, 1.345], (-1.184, 0.0167], (-1.184, 0.0167], (-1.184, 0.0167], (-2.88, -1.184], ..., (0.0167, 1.345], (0.0167, 1.345], (-2.88, -1.184], (1.345, 3.324], (-1.184, 0.0167]]
Length: 1000
Categories (4, interval[float64]): [(-2.88, -1.184] < (-1.184, 0.0167] < (0.0167, 1.345] < (1.345, 3.324]]